package com.zabbix.sisyphus.base.common;

import java.util.HashMap;
import java.util.Map;

/**
 * 流程状态常量
 *@author zabbix
 *2016年10月25日
 */
public class FlowIdConstants {

	private static final Map<String, String> map = new HashMap<>();
	static {

		map.put("01000000", "开户");
		map.put("01000001", "正常");
		map.put("01000002", "逾期");
		map.put("01000003", "呆滞");
		map.put("01000004", "呆账");
		map.put("01000005", "核销");
		map.put("01000006", "部分预期");
		map.put("01000007", "销");

		map.put("20000000", "申请");
		map.put("02000001", "审核中");
		map.put("02000002", "放款中");
		map.put("02000003", "还款中");
		map.put("02000004", "催收中");
		map.put("02000009", "借款结束");
		map.put("02000010", "逾期");
		map.put("02000012", "撤销");
		map.put("02000013", "呆滞");
		map.put("02000014", "呆账");
		map.put("02000015", "借款中");

		map.put("03000001", "初审待分配");
		map.put("03000002", "初审");
		map.put("03000003", "初审通过");
		map.put("03000004", "补件");
		map.put("03000005", "初审驳回");
		map.put("03000006", "终审待分配");
		map.put("03000007", "终审");
		map.put("03000008", "终审通过");
		map.put("03000009", "终审驳回");
		map.put("03000010", "退回初审");
		map.put("03000011", "待初");
		map.put("03000012", "黑名单待审");
		map.put("03000013", "黑名单拒绝");
		map.put("03000014", "已入");

		map.put("04000001", "放款审核");
		map.put("04000002", "放款通过");
		map.put("04000003", "放款拒绝");
		map.put("04000004", "处理中");
		map.put("04000005", "放款失败");
		map.put("04000006", "放款成");

		map.put("05000001", "正常");
		map.put("05000002", "逾期");
		map.put("05000003", "呆滞");
		map.put("05000004", "待还款");
		map.put("05000005", "已还款");
		map.put("05000006", "放款");
		map.put("05000007", "还");

		map.put("06000001", "催收待分配");
		map.put("06000002", "部门催收中");
		map.put("06000003", "催收作业中");
		map.put("06000004", "全部收回");
		map.put("06000005", "部分收回");

		map.put("07000001", "补件中");
		map.put("07000002", "已上传");
		map.put("07000003", "补件完成");

		map.put("08000001", "未还款");
		map.put("08000002", "已结清");
		map.put("08000003", "罚息结清");
		map.put("08000004", "利息结清");
		map.put("08000005", "部分本金");
		map.put("08000006", "部分利息");
		map.put("08000007", "部分罚息");
		map.put("08000008", "凭证无效");
		map.put("08000009", "凭证通过");
		map.put("08000010", "凭证待确认");

		map.put("09000001", "已使用");
		map.put("09000002", "正常");
		map.put("09000003", "过期");

		map.put("10000000", "新建");
		map.put("10000001", "通过");
		map.put("10000002", "拒绝");
		map.put("10000003", "撤销");
		map.put("10000004", "初次撮合");
		map.put("10000005", "初次订购");
		map.put("10000006", "付款中");
		map.put("10000007", "投资生效");
		map.put("10000008", "投资结束");
		map.put("10000009", "投资作废");
		map.put("11000001", "通过");
		map.put("11000002", "拒绝");
		map.put("11000003", "部分收款");
		map.put("11000004", "全部收款");
		map.put("11000005", "已取现");
		map.put("11000006", "撤销");
		map.put("12000001", "新建");
		map.put("12000002", "通过");
		map.put("12000003", "拒绝");
		map.put("12000004", "撤销");
		map.put("12000005", "订购");
		map.put("12000006", "订单撤销");
		map.put("12000007", "部分付款");
		map.put("12000008", "全部付款");
		map.put("12000009", "已收款");
		map.put("13000001", "待审核");
		map.put("13000002", "审核通过");
		map.put("13000003", "审核拒绝");
		map.put("13000004", "未开始");
		map.put("13000005", "进行中");
		map.put("13000006", "满标");
		map.put("13000007", "流标");
	}

	public static String flowIdView(String flowId) {
		return map.get(flowId);
	}
}
